# sets up the basic stuff you need on a new mac
# to run: brew bundle --file=Brewfile_initial

# for homebrew
tap "homebrew/bundle"

# Web browsers
cask "google-chrome"
cask "firefox"
#cask "opera"

# tools that you just need
brew "midnight-commander"
brew "wget"
cask "sublime-text"
cask "visual-studio-code"
cask "github"
cask "warp"

# tools for development
cask "postman"
brew "nvm"
# After installing nvm, add the following to your shell profile (e.g., ~/.zshrc or ~/.bash_profile):
# export NVM_DIR="$HOME/.nvm"
# [ -s "/usr/local/opt/nvm/nvm.sh" ] && \. "/usr/local/opt/nvm/nvm.sh"
# [ -s "/usr/local/opt/nvm/etc/bash_completion.d/nvm" ] && \. "/usr/local/opt/nvm/etc/bash_completion.d/nvm"
# Then, to install and use the latest LTS version of Node.js, run:
# nvm install --lts
# nvm use --lts
brew "yarn"
# a faster npm manager for development 
brew "pnpm"
# for editing ansible in vscode 
brew "ansible"
brew "ansible-lint"

# tools virtual machines and containers
cask "docker"
cask "utm"
cask "multipass"

# tools for working with kubernetes
cask "lens"
brew "k9s"

# tools for office work
# cask "libreoffice"

# tools for communication
cask "messenger"
cask "whatsapp"

# tools for image editing
cask "gimp"

# tools for remote access
# brew "tailscale" # this is not working yet
cask "microsoft-remote-desktop"

# tools for file sharing
# cask "dropbox"
